Repository: vanyog/mycms
Catalog: manage/locale/*/LC_MESSAGES/_install.po
Languages: bg_bg

source: Creation of tables in the database
bg_bg: Създаване на таблици в базата данни

source: File %s exists.
bg_bg: Файл %s съществува.

source: Click here</a> to continue with creation of data tables. If there is data in the tables, it will be deleted and replaced with new data.</p> <p>Or remove conf_database.php file to start a new instalation.</p>
bg_bg: Щракнете тук</a> за да продължите със създаване и попълване на таблици в базата данни. Ако таблиците съществуват и в тях има данни, тези данни ще бъдат изтрити и заменени с нови.</p> <p>За да смените базата данни, изтрийте файл conf_database.php и ще започне ново инсталиране.</p>

source: Language
bg_bg: Език на тази страница

source: Host
bg_bg: Хост

source: Database
bg_bg: Име на базата данни

source: User
bg_bg: Потребител за базата данни

source: Password
bg_bg: Парола на потребителя за базата данни

source: Table mane prefix
bg_bg: Представка за имената на таблиците

source: Save
bg_bg: Запазване

source: Creation of conf_database.php file
bg_bg: Създаване на файл conf_database.php
