<?php

// Тази функция проверява дали с GET e изпратена променлива $k със стойност $v
// или има бисквитка с име $k и стойност $v.
// Ако това е така връща истина.
// Ако с GET e изпратена променлива $k със стойност $v се установява бисквитка.
// Ако e изпратена стойност $_GET[$k]!=$v се установява бисквитка със стойност $v.

function query_or_cookie($k,$v){
if (isset($_GET[$k])){
   setcookie($k,$_GET[$k],time()+60*60*24*30,'/');
   return ($_GET[$k]==$v);
}
else if (isset($_COOKIE[$k])) return ($_COOKIE[$k]==$v);
        else return '';
}

?>
