<?php
// Copyright: Vanyo Georgiev info@vanyog.com

// Ако в някой файл се съдържа затварящ таг /textarea това нарушава структурата на страницата edit_file.php.
// За да стане възможно редактирането на такива файлове в  edit_file.php, преди отварянето им този таг се заменя с неправилно изписан такъв,
// а при записване на файла със save_file.php неправилния таг се заменя отново с правилен.
// За да е възможно edit_file.php да редактира себе си в него таг /textarea не се изписва явно, а като променлива, декларирана тук.

$ta_ctag = '</textarea>';
$ta_fctag = '< /textarea>';

?>
